Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиВыводаДополнительныхПолей</name>
    <attributes>
      <name>РеквизитДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНаУстройстве</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/Forms/ФормаВыбораНастроекИзФайла/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("АдресНастроек") И Не Параметры.Свойство("ВыгрузкаНастроек") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресНастроек") Тогда
		//МассивЗагруженныхНастроек = Параметры.АдресНастроек;
		МассивЗагруженныхНастроек = ПолучитьИзВременногоХранилища(Параметры.АдресНастроек);
		
		Если Параметры.Свойство("ПерезаписыватьСуществующие") ТОгда
			ПерезаписыватьСуществующие = Параметры.ПерезаписыватьСуществующие;
		КонецЕсли;
		
		УдалитьИзВременногоХранилища(Параметры.АдресНастроек);
		
		Для Каждого Настройка Из МассивЗагруженныхНастроек Цикл 
			
			СтрокаТаблицыНастроек = ТаблицаНастроекДокументов.Добавить(); 
			СтрокаТаблицыНастроек.НаименованиеНастройкиДокумента = Настройка.Наименование; 
			СтрокаТаблицыНастроек.ИмяОбъектаМетаданных = Настройка.ИмяОбъектаМетаданных; 
			СтрокаТаблицыНастроек.Комментарий = ?(Настройка.Свойство("Комментарий"),Настройка.Комментарий, ""); 
			СтрокаТаблицыНастроек.КлючЗаписи = Новый УникальныйИдентификатор; 
			СтрокаТаблицыНастроек.Загружать = Истина;
			Настройка.Вставить("КлючЗаписи", СтрокаТаблицыНастроек.КлючЗаписи);
			
		КонецЦикла;
		
		АдресНастроек = ПоместитьВоВременноеХранилище(МассивЗагруженныхНастроек, УникальныйИдентификатор);
		
	ИначеЕсли Параметры.Свойство("ВыгрузкаНастроек") Тогда
		
		ВыгрузкаДанных = Параметры.ВыгрузкаНастроек;
		
		Элементы.ПерезаписыватьСуществующие.Видимость = Ложь;
		
		Если Не ВыгрузкаДанных Тогда
			Отказ = Истина;
			Возврат;	
		КонецЕсли; 
		
		Элементы.ТаблицаНастроекДокументовЗагружать.Заголовок = "Выгружать";
		Элементы.ЗагрузитьВыбранное.Заголовок = "Выгрузить выбранное"; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	SUI_НастройкиДокументов.Ссылка КАК Ссылка,
		|	SUI_НастройкиДокументов.Наименование КАК Наименование,
		|	SUI_НастройкиДокументов.Комментарий КАК Комментарий,
		|	SUI_НастройкиДокументов.ИмяОбъектаМетаданных КАК ИмяОбъектаМетаданных
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов
		|ГДЕ
		|	НЕ SUI_НастройкиДокументов.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТаблицыНастроек = ТаблицаНастроекДокументов.Добавить(); 
			СтрокаТаблицыНастроек.НаименованиеНастройкиДокумента = ВыборкаДетальныеЗаписи.Наименование; 
			СтрокаТаблицыНастроек.ИмяОбъектаМетаданных = ВыборкаДетальныеЗаписи.ИмяОбъектаМетаданных; 
			СтрокаТаблицыНастроек.Комментарий = ВыборкаДетальныеЗаписи.Комментарий; 
			СтрокаТаблицыНастроек.Ссылка = ВыборкаДетальныеЗаписи.Ссылка; 
			СтрокаТаблицыНастроек.Загружать = Истина;
		КонецЦикла;
			
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьВыбранное(Команда)
	
	Если Не ВыгрузкаДанных Тогда
		
		ОчиститьСообщения();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Загружать", Истина);
		СтрокиКЗагрузке = ТаблицаНастроекДокументов.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиКЗагрузке.Количество() = 0 Тогда 
			SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны настройки.'"));
			Возврат;
		КонецЕсли;
		
		СтруктураВозврата = ИзмененияВыбораНаСервереЗагрузка();
		
		Закрыть(СтруктураВозврата);
		
	Иначе
		
		ОчиститьСообщения();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Загружать", Истина);
		СтрокиКЗагрузке = ТаблицаНастроекДокументов.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиКЗагрузке.Количество() = 0 Тогда 
			SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны настройки.'"));
			Возврат;
		КонецЕсли;
		
		СтруктураВозврата = ИзмененияВыбораНаСервереВыгрузка();
		
		Закрыть(СтруктураВозврата);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	СнятьВыбратьВсе();
КонецПроцедуры

&НаКлиенте
Процедура УбратьВыборВсе(Команда)
	СнятьВыбратьВсе(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИзмененияВыбораНаСервереЗагрузка()
	
	МассивДокументов = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Загружать", Истина);
	СтрокиКЗагрузке = ТаблицаНастроекДокументов.НайтиСтроки(ПараметрыОтбора);
	
	МассивИтоговый = Новый Массив;
	
	Для Каждого СтрокаМассиваДокументов Из МассивДокументов Цикл 
		Для Каждого Строка Из СтрокиКЗагрузке Цикл
			Если Строка.КлючЗаписи = СтрокаМассиваДокументов.КлючЗаписи Тогда
				МассивИтоговый.Добавить(СтрокаМассиваДокументов);
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ПерезаписыватьСуществующие",ПерезаписыватьСуществующие);
	СтруктураВозврата.Вставить("АдресНастроек",ПоместитьВоВременноеХранилище(МассивИтоговый));
	
	Возврат СтруктураВозврата;
	
КонецФункции 

&НаСервере
Функция ИзмененияВыбораНаСервереВыгрузка()
		
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Загружать", Истина);
	СтрокиКЗагрузке = ТаблицаНастроекДокументов.НайтиСтроки(ПараметрыОтбора);
	
	МассивИтоговый = Новый Массив;
	
	Для Каждого Строка Из СтрокиКЗагрузке Цикл
		МассивИтоговый.Добавить(Строка.Ссылка);			
	КонецЦикла;	
		
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("МассивИтоговый", МассивИтоговый);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция СнятьВыбратьВсе(ВыбратьВсе = Истина)

	Для Каждого СтрокаНастройки Из ТаблицаНастроекДокументов Цикл
		СтрокаНастройки.Загружать = ВыбратьВсе;	
	КонецЦикла;

КонецФункции // СнятьВыбратьВсе()

#КонецОбласти
